# 题目：一个数如果恰好等于它的因子之和，这个数就称为"完数"。
# 例如6=1＋2＋3.编程找出1000以内的所有完数。

# 程序源代码
# ======================================================

from sys import stdout

for j in range(2, 1001):
    k = []  # 用来保存因子集
    n = -1  # 保存的是因子的下标
    s = j   # 用来保存计算中产生的中间变量
    for i in range(1, j):
        if j % i == 0:
            n += 1
            s -= i  # 因子之和
            k.append(i)

    if s == 0:
        print(j)    # 打印出完数
        for i in range(n):
            stdout.write(str(k[i]) + ' ')
        print(k[n])

# ======================================================

# 输出结果:
# 6
# 1 2 3
# 28
# 1 2 4 7 14
# 496
# 1 2 4 8 16 31 62 124 248